<!DOCTYPE html>
<html>
<head>
	<title>ABOUT</title>
	<link rel="stylesheet" type="text/css" href="style.css">

</head>
<body>
 	
 	<?php 
			include("header.php"); 
			include("menu.php"); 
	?>

	

	<div class="containt2">
		<img class="im" class="img" src="images/20160706_170911.jpg" width="450px" height="400px">
	<div class="about">
		<h4>Բադալյան Տիգրան</h4>
		<h6>ծնվել է 17.06.2002</h6>
	</div><br>
<p class="pt">Ծնվել եմ 2002թվականի հունիսի 17-ին, փոքր ժամանակից հետաքրքրված էի տեխնիիկականն առականերով և մանավանդ Համակարգչայն ծրագրավորումով,սակայն միշտ չեմ սիրել հոմանիտար առարկաները (պատմությունները, գրականութունը և այլն)։ Լեզուներից չէի սիրում ու չեմ սիրում ՖՐԱՆՍԵՐԵՆԸ։ Բազմիցս մասնակցել եմ տարբեր օլիմպիադաների։
Հույս ունեմ ավարտելու ավագ դպրոցը բնագիտական հոսքով և սովորել ու աշխատել որպես ծրագրավորող։ Շատ հետաքրքված եմ թումոով, ֆիզիկայով ինչպես նաև շախմաով։ Ունեմ պաշտոնական կարգ, մասնակցում եմ բազմաթիվ մրցությների։ Սովորում եմ ներկայումս 9 դասարանում։
բազմաթիվ: <b class="s">Շատ շնորհակալ եմ այս դասնթացի կազմակերպիչներին և ուսուցիչ Արամայիս Գրիգորյանին, ով սովորեցրեց ինձ ահագին բան կայքերի ստեղծման մասին:</b> </p>

<?php 
	include("footer.php"); 
?>
 	


</div>
</body>
</html>