<!DOCTYPE html>
<html>
<head>
	<title>css</title>
	<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
		<?php 
			include("header.php"); 
			include("menu.php"); 
		?>
		
	<div class="containt4">
			<h1 class="h1">CSS</h1>
				<ul class="html">
 		<li><b>CSS</b>-ը html փաստաթղթերի ոճավորումը նկարագրող լեզու է.
</li>
 		<li><b>CSS</b> հապավումը բացվում է որպես Cascading Style Sheets (կասկադային ոճաթերթեր).

 		<li> <b>CSS</b> նկարագրում է, թե ինչպես պիտի արտացոլվեն HTML էլեմենտները մոնիտորի վրա</li>
 		<li><b>CSS</b>-ով կարելի է միանգամից կառավարել բազմաթիվ էջերի ոճավորումը։ Սա շատ աշխատանք և ժամանակ է խնայում։ 
</li>
 		<li>Արտաքին ոճաթերթերը պահպանվում են <b>CSS</b> ֆայլերում </ul><br>

 		<h5 class="h5">CSS նկարագրումը կազմված է ընտրիչից (selector) և սահմանման բլոկից։</h5>

	<img class="img" src="images/Active-Selelctor-Contetn.png" width="300px" height="300px" class="sel">
	<img class="img" src="images/css-selector.png"
	width="300px" height="300px" class="sel"><br><br><br>

	<h6 class=h6>
- Ընտրիչը(selector) որոշում է այն HTML էլեմեները, որոնք ուզում ես ոճավորել։
- Սահմանման բլոկը պարունակում է մեկ կամ ավելի սահմանումներ, որոնք բաժանված են կետ-ստորակետ (;) նշանով
- Յուրաքանչյուր սահմանում ներառում է CSS հատկանիշի անունը և արժեքը՝ բաժանված վերջակետ (:) նշանով
- Սահմանման բլոկը պարփակված է ձևավոր փակագծերով․</h6>
<h6 class="h62">HTML էլեմենտները CSS-ի միջոցով ընտրելու և ոճավորելու համար օգտագործվում են հետևյալ 3 ընտրիչները (selectors):</h6>
<ol>
	<li>tag-ի անունունով ընտրիչ (element selector)</li>
	<li>id ընտրիչ (id selector)
</li>
<li>class ընտրիչ (class selector)
</li>
</ol>
<img class="img" src="images/css.jpg" width="300px" height="300px" class="sel">
<img class="img" src="images/css3_logo_wide.png" width="300px" height="300px" class="sel">
<h6 class="h63">CSS-ը օգտագործվում է վեբ-էջեր նախագծողների կողմից գույները, տառատեսակները, գտնվելու վայրը և այլ նկարագրություններ տալու համար։ CSS-ի հիմնական նպատակը հանդիսանում է այն, որ դրա օգնությամբ առանձնացվում են HTML էջի պարունակությունը և նրա նկարագրությունը, դրանով իսկ էջին հաղորդվում է մատչելիություն, ճկունություն և նրա նկարագրությունը կառավարելու հնարավորություն, ինչպես նաև նվազեցնում է հրամանների կրկնվելը և բարդացնելը։ Բացի այդ CSS-ը թույլ է տալիս տվյալ դոկումենտը ներկայացնել տարբեր ոճերով։ Էջի արտածման ժամանակ CSS-ը կարող է վերցվել տարբեր աղբյուրներից՝</h6>
<h6 class="h64">Իսկ ես իսկապես հացկացա թե ինչ է CSS-ը, սովորեցի թե ինչես այն օգտագործել, ծանոթացա բազմաթիվ թեգերի, հատկանիշների, արժեքների հետ, սովորեցի էջը գեղեցիկ զարդարել, և ցույց տվեցի ձեզ թե ինպես եմ դա կատարում, սովորեցի թե ինչ է hover-ը և ինչպես այն օգտագործել:</h6>


<?php 
	include("footer.php"); 
?>
	

	</div>



</body>

</html>