<!DOCTYPE html>
<html>
<head>
	<title>Շախմատ</title>
	<!---<link rel="stylesheet" type="text/css" href="style.css">-->
	<link rel="stylesheet" type="text/css" href="style.css">
	
</head>
<body>
	
 	<?php 
		include("header.php"); 
		include("menu.php"); 
	?>
	
	<div class="containt">
	    <img src="images/300px-ChessSet.jpg" width="250px">
		<p><b>Շախմատ կամ Ճատրակ</b>, երկու խաղացողի համար նախատեսված սեղանի խաղ, որը խաղում են հաջորդաբար բաց և մուգ գույնի 64 դաշտ ունեցող (8 x 8 վանդակ) քառակուսի խաղատախտակի վրա։ Աշխարհում ամենատարածված խաղերից մեկն է․ միլիոնավոր մարդիկ շախմատ են խաղում տանը, հասարակական վայրերում, շախմատային ակումբներում, համակարգիչներով, առցանց, նամակագրությամբ և մրցաշարերում։</p>
		<p>Շախմատային պարտիայի (խաղի) սկզբում խաղացողներից յուրաքանչյուրը ունենում է 16 խաղաքար՝ մեկ արքա, մեկ թագուհի, երկու նավակ, երկու ձի, երկու փիղ և ութ զինվոր։ Ընդամենը վեց տեսակի խաղաքարերից յուրաքանչյուրը քայլում է յուրովի։ Խաղաքարերը օգտագործվում են հակառակորդի խաղաքարերը հարվածելու և վերցնելու համար, խաղի նպատակն է «մատ հայտարարել» հակառակորդի արքային,այն է, «հարվածի տակ վերցնել» հակառակորդի արքային, այնպես, որ հարվածից հնարավոր չլինի խուսափել։ Բացի մատ հայտարարելու դեպքից, խաղը համարվում է շահած, եթե</p>


 		<ul>
 		<li><b>հակառակորդը ինքնակամ հանձնվել է,</li>
 		<li>հակառակորդը սպառել է ժամանակը,</li>
 		<li>
հակառակորդը չի ներկայացել խաղին։</li>
 		<li>խաղատախտակի վրա պատ է (տվյալ խաղացողը չունի ոչ մի քայլ),</li>
 		<li>կողմերից մեկը հայտարարում է հավերժական շախ,</li>
 		<li>դիրքը կրկնվում է երեք անգամ, եթե բոլոր դեպքերում քայլ պետք է կատարի նույն խաղացողը,</li>
 		<li>հիսուն քայլի ընթացքում չի վերցվել ոչ մի ֆիգուր և ոչ մի զինվոր չի կատարել քայլ,</li>
 		<li>կողմերի համաձայնությամբ</b></li>
		</ul>

		<p><b>Շախմատի գյուտի պատմությունը</b>
Ավանդությունը մեզ հասցրել է այդ մասին հետևյալը. Հնդկաստանի թագավորներից մեկը իրեն շրջապատել էր շողոքորթ պալատականներով։ Նրանց կեղծ գովասանքից թագավորի գլուխը պտույտ էր եկել և դարձել էր շատ ինքնավստահ։ Ինքնահավան թագավորը չէր լսում ոչ միայն ժողովրդի ձայնը, այլև հաշվի չէր նստում փիլիսոփաների ու գիտնականների հետ։ Սիսսուն, որը նույնպես վշտացած էր թագավորի անձնական քմահաճույքներից ու ինքնահավանությունից, որոշում է ապացուցել թագավորին, որ նա ինքնըստինքյան ոչինչ է, որ նա չի կարող շահել որևէ պայքար առանց իր հպատակների, առանց նրանց պաշտպանության։ Սիսսու փիլիսոփան երկար մտածում է ու վերջապես հնարում է շախմատը։ </p>

		
	</div>

	<?php 
		include("footer.php"); 
	?>





	</div>




</body>
</html>